from unittest import TestCase, main
from main import *


class test_FileStat(TestCase):
        def test_filestat(self):
            #Проверка на маленькой выборке данных
                self.assertEquals(text_stat("data.txt"),{'Word ammount': 3, 'I': (1, 1), 'l': (1, 1), 'o': (2, 2), 'v': (1, 1), 'e': (1, 1), 'p': (1, 1), 'y': (1, 1), 't': (1, 1), 'h': (1, 1), 'n': (1, 1)})
                print(text_stat("data.txt"))
            #Проверка на большой выборке
                self.assertEquals(text_stat("data2.txt"), {'Word ammount': 553, 'О': (5, 5), 'к': (71, 66), 'т': (150, 136), 'я': (60, 58), 'б': (54, 54), 'р': (117, 114), 'ь': (55, 54), 'Paragraph amount': 67, 'у': (67, 63), 'ж': (27, 27), 'н': (173, 158), 'а': (182, 167), 'с': (130, 118), 'п': (58, 56), 'и': (156, 141), 'л': (109, 107), 'о': (259, 210), 'щ': (11, 11), 'х': (27, 27), 'е': (246, 197), 'П': (4, 4), 'д': (92, 91), 'ы': (63, 62), 'г': (47, 47), 'в': (123, 115), 'й': (50, 50), 'Д': (3, 3), 'м': (93, 88), 'з': (47, 46), 'Ж': (2, 2), 'ч': (27, 26), 'ц': (12, 12), 'Н': (8, 8), 'ш': (15, 15), 'В': (7, 7), 'ъ': (2, 2), 'ю': (32, 29), 'И': (21, 21), 'Т': (6, 6), 'С': (4, 4), 'К': (11, 11), 'Л': (4, 4), 'А': (2, 2), 'э': (3, 3), 'М': (5, 5), 'Я': (3, 3), 'Б': (1, 1), 'У': (2, 2), 'З': (3, 3), 'Ч': (1, 1), 'ф': (1, 1), 'Г': (1, 1)})

